docs/build/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-30 Wed 00:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to build tools</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Katherine Chuang" />

<link rel="stylesheet" type="text/css" href="../assets/style.min.css"/>

</head>
<body>
<div id="content">
<h1 class="title">Introduction to build tools</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0f3a3b3">1. What is a build tool?</a></li>
<li><a href="#org2798879">2. GNU Make</a>
<ul>
<li><a href="#org9f62672">2.1. Makefile</a></li>
</ul>
</li>
<li><a href="#org921466a">3. Apache Maven</a>
<ul>
<li><a href="#org609641c">3.1. Maven Project</a>
<ul>
<li><a href="#org8e5c469">3.1.1. Maven Commands</a></li>
<li><a href="#org46c3099">3.1.2. Creating a Maven project from Scratch</a></li>
<li><a href="#org565a4aa">3.1.3. Explaining the pom.xml configiguration file</a></li>
<li><a href="#org9cd9ed9">3.1.4. Project File structure</a></li>
<li><a href="#org8d39733">3.1.5. Compile and Run</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org998fecf">4. Choosing a Build tool</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0f3a3b3" class="outline-2">
<h2 id="org0f3a3b3"><span class="section-number-2">1</span> What is a build tool?</h2>
<div class="outline-text-2" id="text-1">
<p>
A build tool is a programming utility that automates a software build task, such as compiling source code, cleaning temporary files, and so on. A popular open source build tool is <a href="https://www.gnu.org/software/make/">Make</a>, another popular build tool is <a href="https://maven.apache.org/">Maven</a>
</p>
</div>
</div>

<div id="outline-container-org2798879" class="outline-2">
<h2 id="org2798879"><span class="section-number-2">2</span> GNU Make</h2>
<div class="outline-text-2" id="text-2">
<p>
Make is a build tool released by GNU. Make was original designed to work with C source code. Make configurations are specified by a text file named <code>Makefile</code>.
</p>
</div>

<div id="outline-container-org9f62672" class="outline-3">
<h3 id="org9f62672"><span class="section-number-3">2.1</span> Makefile</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A programmer specifies how to build program from a file called a <i>makefile</i>, which lists a bunch of <i>rules</i>, each of which specifies the target, dependencies and commands.
</p>

<p>
Once you create a <i>makefile</i>, you don&rsquo;t have to meticulously track details of how to build the file again, because the details are recorded in the makefiles you prepared. You can use make with any language.
</p>


<p>
An example of a make file:
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #51afef;">hello</span>:
    javac hello.java
</pre>
</div>

<p>
To run the make file, you can run <code>make</code> in a terminal.
</p>

<p>
Alternatively you can name your <i>makefile</i> with any name an run it with the -f flag option like so <code>make -f myFile.mak</code>
</p>
</div>
</div>
</div>



<div id="outline-container-org921466a" class="outline-2">
<h2 id="org921466a"><span class="section-number-2">3</span> Apache Maven</h2>
<div class="outline-text-2" id="text-3">
<p>
Maven is a build tool released by The Apache Software Foundation, which is a non-profit organization that maintains many open source software. Maven is a build tool and also a project management tool.
</p>
</div>

<div id="outline-container-org609641c" class="outline-3">
<h3 id="org609641c"><span class="section-number-3">3.1</span> Maven Project</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The <i>workspace</i> concept with Maven is at the unit of a <i>project</i>. A Maven project must have a <code>pom.xml</code> file at the root directory as a way to configure the project specific information. It works like a recipe in specifying the dependencies required for the project (i.e. any open source libraries used) and also specifying the way the project should be built.
</p>
</div>

<div id="outline-container-org8e5c469" class="outline-4">
<h4 id="org8e5c469"><span class="section-number-4">3.1.1</span> Maven Commands</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
The syntax for running Maven in a terminal is a pattern as follows:
</p>

<div class="org-src-container">
<pre class="src src-shell">mvn <span style="color: #51afef;">[</span>options<span style="color: #51afef;">]</span> <span style="color: #51afef;">[</span>&lt;goal<span style="color: #c678dd;">(</span>s<span style="color: #c678dd;">)</span>&gt;<span style="color: #51afef;">]</span> <span style="color: #51afef;">[</span>&lt;phase<span style="color: #c678dd;">(</span>s<span style="color: #c678dd;">)</span>&gt;<span style="color: #51afef;">]</span>
</pre>
</div>

<p>
<code>mvn</code> is the program and the following are parameters provided to the program.
</p>

<p>
Available options for each of the parameters can be found by checking the manual page using <code>man mvn</code>
</p>
</div>
</div>

<div id="outline-container-org46c3099" class="outline-4">
<h4 id="org46c3099"><span class="section-number-4">3.1.2</span> Creating a Maven project from Scratch</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
The instructions for getting started are on Maven&rsquo;s website <a href="https://maven.apache.org/">https://maven.apache.org/</a>, under the page Maven in 5 minutes. This would be a good starting point to see the whole process however take your time to read through the docs to figure out specific configuration settings.
</p>

<p>
Basically, from the root directory of your project, run this in a terminal:
</p>

<div class="org-src-container">
<pre class="src src-shell">mvn -B archetype:generate -DgroupId=myApp -DartifactId=maven-example
</pre>
</div>

<p>
This would create a <code>pom.xml</code> file in the folder <code>maven-example</code> with maven&rsquo;s project structure within it. The flag <code>-DgroupId</code> is how you name your project and here the name <code>myApp</code> is given.
</p>
</div>
</div>

<div id="outline-container-org565a4aa" class="outline-4">
<h4 id="org565a4aa"><span class="section-number-4">3.1.3</span> Explaining the pom.xml configiguration file</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
There are a few things to configure for a maven build project. Keep in mind that this is an XML file so it means you should know generally how an XML file is structured. XML files use tags, arranged in nested order like tree nodes. It can be thought of as a text-based database. It uses the file extension <code>.XML</code>
</p>
</div>

<ol class="org-ol">
<li><a id="org6dbded8"></a>Java Version<br />
<div class="outline-text-5" id="text-3-1-3-1">
<p>
To use Java 8, you can specify it for your project like so:
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">properties</span>&gt;
  &lt;<span style="color: #c678dd;">maven.compiler.target</span>&gt;1.8&lt;/<span style="color: #c678dd;">maven.compiler.target</span>&gt;
  &lt;<span style="color: #c678dd;">maven.compiler.source</span>&gt;1.8&lt;/<span style="color: #c678dd;">maven.compiler.source</span>&gt;
&lt;/<span style="color: #c678dd;">properties</span>&gt;
</pre>
</div>
</div>
</li>

<li><a id="orgc05ad98"></a>Project Libraries to include (dependencies)<br />
<div class="outline-text-5" id="text-3-1-3-2">
<p>
In order to include dependencies you would include each dependency under the dependencies block.
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">dependencies</span>&gt;
    &lt;<span style="color: #c678dd;">dependency</span>&gt;
        &lt;<span style="color: #c678dd;">groupId</span>&gt;junit&lt;/<span style="color: #c678dd;">groupId</span>&gt;
        &lt;<span style="color: #c678dd;">artifactId</span>&gt;junit&lt;/<span style="color: #c678dd;">artifactId</span>&gt;
        &lt;<span style="color: #c678dd;">version</span>&gt;x.x.x&lt;/<span style="color: #c678dd;">version</span>&gt;
    &lt;/<span style="color: #c678dd;">dependency</span>&gt;
&lt;/<span style="color: #c678dd;">dependencies</span>&gt;
</pre>
</div>

<p>
More dependencies can be found within the <a href="https://mvnrepository.com/">Maven repository</a>.
</p>
</div>
</li>

<li><a id="org066ad49"></a>Build Plugins<br />
<div class="outline-text-5" id="text-3-1-3-3">
<p>
Plugins can be helpful. If there is any that you would like to add, it would be under a block like so.
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">build</span>&gt;
    &lt;<span style="color: #c678dd;">plugins</span>&gt;
        &lt;<span style="color: #c678dd;">plugin</span>&gt;
            ....
        &lt;/<span style="color: #c678dd;">plugin</span>&gt;
    &lt;/<span style="color: #c678dd;">plugins</span>&gt;
&lt;/<span style="color: #c678dd;">build</span>&gt;
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org9cd9ed9" class="outline-4">
<h4 id="org9cd9ed9"><span class="section-number-4">3.1.4</span> Project File structure</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
The code you&rsquo;re working with can be found under the root directory under the path <code>src/main/java/package/</code>
</p>

<p>
In your file under this path, such as <code>Main.java</code>, that&rsquo;s where you can import libraries at the top of the file.
</p>

<p>
Maven figures out for you how to install and connect everything so you don&rsquo;t have to worry about manually maintaining where files should go.
</p>
</div>
</div>


<div id="outline-container-org8d39733" class="outline-4">
<h4 id="org8d39733"><span class="section-number-4">3.1.5</span> Compile and Run</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
Once the configuration file is set up, all you have to worry about during and after development is to compile your project with ease.
</p>

<p>
When successfully built, Maven will produce an executable file under a <code>target</code> directory under root.
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-org998fecf" class="outline-2">
<h2 id="org998fecf"><span class="section-number-2">4</span> Choosing a Build tool</h2>
<div class="outline-text-2" id="text-4">
<p>
It comes down to what you like, which supports your needs.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Katherine Chuang</p>
<p class="date">Created: 2020-09-30 Wed 00:15</p>
</div>
</body>
</html>
